var collegeList = ["全部", "经济与统计学院", "物理与电子工程学院", "生命科学学院", "建筑与城市规划学院", "化学化工学院", "地理科学学院", "马克思主义学院", "工商管理学院", "法学院(律师学院)", "公共管理学院", "环境科学与工程学院", "计算机科学与网络工程学院", "机械与电气工程学院", "教育学院(师范学院)", "旅游学院(中法旅游学院)", "美术与设计学院", "人文学院", "数学与信息科学学院", "土木工程学院", "体育学院", "外国语学院", "新闻与传播学院", "音乐舞蹈学院", "国际教育学院/卫斯理安学院"]

var collegeMap = {
  "全部": "",
  "经济与统计学院": "0264",
  "物理与电子工程学院": "0219",
  "生命科学学院": "0214",
  "建筑与城市规划学院": "0209",
  "化学化工学院": "0205",
  "地理科学学院": "0201",
  "马克思主义学院": "0263",
  "工商管理学院": "0265",
  "法学院(律师学院)": "0202",
  "公共管理学院": "0203",
  "环境科学与工程学院": "0204",
  "计算机科学与网络工程学院": "0206",
  "机械与电气工程学院": "0207",
  "教育学院(师范学院)": "0208",
  "旅游学院(中法旅游学院)": "0210",
  "美术与设计学院": "0211",
  "人文学院": "0212",
  "数学与信息科学学院": "0215",
  "土木工程学院": "0216",
  "体育学院": "0217",
  "外国语学院": "0218",
  "新闻与传播学院": "0220",
  "音乐舞蹈学院": "0221",
  "国际教育学院/卫斯理安学院": "0268",
}

var statusList = ["全部", "班级未审核", "年级未审核", "学院未审核", "班级审核不通过", "年级审核不通过", "学院审核不通过", "班级审核已通过", "年级审核已通过","学院审核已通过"]
var statusMap = {
  "全部": "",
  '班级未审核': "shbz=1",
  "年级未审核": "shbz<4",
  "学院未审核": "shbz<6",
  "班级审核不通过": "shbz_bj=1",
  "年级审核不通过": "shbz_nj=1",
  "学院审核不通过": "shbz=6",
  "班级审核已通过": "shbz_bj=2",
  "年级审核已通过": "shbz_nj=2",
  "学院审核已通过": "shbz=7",
}

module.exports = {
  collegeList: collegeList,
  collegeMap: collegeMap,
  statusList: statusList,
  statusMap: statusMap,
}